# Praktikum 1

In [80]:
#This is a comment line
print('Hello world!')

Hello world!

In [81]:
a=3
print(a)
b=2
print(b)

3
2

In [82]:
print(5>2)

True

In [83]:
print(5==3)

False

In [84]:
# List
# bisa ditambahkan isinya
# bisa terdiri dari gabungan tipe data yang berbeda : string, numerik, dll
# pakai kurung siku []

fruits=['apple', 'banana']
another_list=['this is string', 10] # list dengan element yg type nya berbeda

print(fruits)
print(another_list)

combined=[fruits,another_list]
print(combined)

['apple', 'banana']
['this is string', 10]
[['apple', 'banana'], ['this is string', 10]]

In [85]:
# menambahkan element ke dalam list
fruits=['apple', 'banana']
fruits.append('grape')
print(fruits)

fruits=fruits+['mango']
print(fruits)

['apple', 'banana', 'grape']
['apple', 'banana', 'grape', 'mango']

In [86]:
# Tuple 
# tipe data harus sama
# tidak bisa ditambahkan variabel baru 
# pakai kurung biasa ()

coordinate = (1,3)
colors = ('purple', 'pink', 'yellow')
print(coordinate)
print(colors)

(1, 3)
('purple', 'pink', 'yellow')

## Data Integration

In [87]:
import pandas as pd
import numpy as np

In [88]:
# Merging
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                    'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key': ['K0','K1','K2','K3'],
                     'C': ['C0','C1','C2','C3'],
                     'D': ['D0','D1','D2','D3']})
result1=pd.merge(left,right,on='key')
result1

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [89]:
# Multiple key
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                    'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                     'key2': ['K0', 'K0', 'K0', 'K0'],
                     'C': ['C0','C1','C2','C3'],
                     'D': ['D0','D1','D2','D3']})
result2=pd.merge(left,right,on=['key1','key2'])
result2

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [90]:
# Export data
#namadata.to_csv("letak dan nama data.csv")

# Marging
#data1=pd.read_csv("D:\folder\file1.csv")
#data2=pd.read_csv("D:\folder\file2.csv")

#data_complete=pd.merge(data1,data2,on=['data_code'])
#data_complete.head() # untuk melihat data bagian atas saja, apakah data yg digabung sudah benar/belum

In [91]:
import pandas as pd
#pd.merge() untuk menggabungkan kolom

# Marging
kelas1=pd.read_csv('E:\kuliah\data mining statistika\praktikum 1\data1.csv', sep=';')
kelas2=pd.read_csv('E:\kuliah\data mining statistika\praktikum 1\data2.csv', sep=';')

kelas_complete=pd.merge(kelas1,kelas2,on='Kelas')
kelas_complete.head()

#export
kelas_complete.to_csv('E:\kuliah\data mining statistika\praktikum 1\GabunganNilai.csv')

In [92]:
kelas_complete.head()

  Kelas IPK_x IPS_x IPK_y IPS_y
0     A   2,3     3   3,4     3
1     A   2,3     3   2,9   2,2
2     A   3,2   3,1   3,4     3
3     A   3,2   3,1   2,9   2,2
4     B   1,5   2,9   3,2   3,1

In [93]:
kelas1

  Kelas  IPK  IPS
0     A  2,3    3
1     A  3,2  3,1
2     B  1,5  2,9
3     B  2,7  1,5
4     C  3,8  3,4
5     C    4    4

In [94]:
kelas2

  Kelas  IPK  IPS
0     A  3,4    3
1     B  3,2  3,1
2     C  2,8    2
3     A  2,9  2,2
4     B  1,4  1,2
5     C  1,9  3,5

In [95]:
import pandas as pd

# Marging
kelas1=pd.read_csv('E:\kuliah\data mining statistika\praktikum 1\data1.csv', sep=';')
kelas2=pd.read_csv('E:\kuliah\data mining statistika\praktikum 1\data2.csv', sep=';')

# pd.concat() untuk menggabungkan baris
kelas=pd.concat([kelas1,kelas2])
kelas.head()

  Kelas  IPK  IPS
0     A  2,3    3
1     A  3,2  3,1
2     B  1,5  2,9
3     B  2,7  1,5
4     C  3,8  3,4

In [96]:
kelas

  Kelas  IPK  IPS
0     A  2,3    3
1     A  3,2  3,1
2     B  1,5  2,9
3     B  2,7  1,5
4     C  3,8  3,4
5     C    4    4
0     A  3,4    3
1     B  3,2  3,1
2     C  2,8    2
3     A  2,9  2,2
4     B  1,4  1,2
5     C  1,9  3,5